[
  {
    "title": "Embu Demonstration",
    "tags": [
      "travel",
      "ethiopia",
      "kenya",
      "gcs"
    ],
    "featured": true,
    "views": true,
    "date": "3/12/2010",
    "author": "Reuben Cummings",
    "excerpt": "Upon returning from Ethiopia, I met up with Jodie and Daniel in Nairobi, Kenya to head to Embu (a city northwest of Nairobi) for a project demonstration. In Embu, we met with Mama Peter, the chairwoman of the Kenera Women's Water Project, and some members of the town youth group.",
    "content": "Upon returning from Ethiopia, I met up with Jodie and Daniel in Nairobi, Kenya to head to Embu (a city northwest of Nairobi) for a project demonstration. In Embu, we met with Mama Peter, the chairwoman of the Kenera Women's Water Project, and some members of the town youth group. We came because we heard the community had maize ready for shelling and since dry maize is pretty scarce this time in Arusha, we were eager to get feedback on our sheller. After talking with the group about the Water Project and our maize sheller, we went to Mama Peter's farm where a pile of maize drying in the sun awaited us. We assembled the machine with a few of the group members and began shelling the corn. Unfortunately, the maize wasn't quite dry enough and we had a difficult time trying to shell it. Next, we demonstrated the cell phone charger but the group informed us that most of the villagers have access to electricity so the demand for a bicycle powered charger wouldn't be as high.\n\nAfterward, we showed the group how they could use the leftover corn husks and cobs to make charcoal in a metal drum. The process is relatively simple: you layer the cobs and husks inside the drum, light it on fire from the top and bottom, burn off the water, cover it, mix it with cassava, and press it to briquettes. The group was very impressed with the charcoal (more so than they were with the maize sheller) and interested in exploring the business opportunities our devices presented. We left a maize sheller with the group and they told us they would do more testing once the maize dried for a few more days."
  },
  {
    "title": "Kikatiti Demo",
    "tags": [
      "gcs",
      "tanzania"
    ],
    "date": "3/25/2010",
    "author": "Reuben Cummings",
    "excerpt": "Today I experienced my second GCS demo. This one was at a CNFA agrodealer exhibition in Kikatiti, Tanzania. The exhibition site was located in an open field near an elementary school pretty high in the hills. Once we set up the tent, Philemon and I prepared our booth and waited for the villagers to come. A small crowd soon formed around us as we began shelling the maize we brought with us.",
    "content": "Today I experienced my second GCS demo. This one was at a [CNFA](http://www.cnfa.org/) agrodealer exhibition in Kikatiti, Tanzania. The exhibition site was located in an open field near an elementary school pretty high in the hills. Once we set up the tent, Philemon and I prepared our booth and waited for the villagers to come. A small crowd soon formed around us as we began shelling the maize we brought with us. After shelling a few cobs, I got off the bike and passed out brochures. With my limited knowledge of Kiswahili, I said \"Nasema Kiswahili kidogo tu\" (\"I only speak a little Swahili\") to anyone who spoke to me and pointed at the brochure if I heard \"shingapi?\" (\"how much?\"). We also demonstrated the cell phone charger which went over very well with the crowd. Ultimately, our customers will be the other agrodealers present at the exhibition so we will have to figure out the best way to get them as interested in our devices as the villagers were."
  },
  {
    "title": "Thoughts on Arusha",
    "tags": [
      "tanzania"
    ],
    "date": "4/09/2010",
    "author": "Reuben Cummings",
    "excerpt": "So far, I've been in Arusha for a month and have found my time here to be quite enjoyable. My first observations were how much brighter the stars look in the sky and how small the community is. The size of the community became apparent after going out my second night and recognizing many of the patrons from my previous night out.",
    "content": "So far, I've been in Arusha for a month and have found my time here to be quite enjoyable. My first observations were how much brighter the stars look in the sky and how small the community is. The size of the community became apparent after going out my second night and recognizing many of the patrons from my previous night out. Since the selection of night clubs is rather limited, it appears that each one has a core following of people who show up religiously each week. Unfortunately, the following tends to consist of an order of magnitude more men than women. But fortunately, the DJ's have been consistently good and play a mix of reggae, tanzanian/african tunes, hip-hop, and house.\n\nMy neighborhood, although just a few minute drive to town, has a very rural feel to it. It's fairly common to share the dirt roads with a herd of cattle or goats looking for pasture, or a mother hen and her chicks pecking for food. I've become quite accustomed to waking up to the crow of our neighbor's rooster and the occasional flock of chickens that raid our front yard looking for food scraps. However, despite the ruralness of our village, most everything you could possibly need is readily available. Around the corner from our house is a \"strip mall\" of duka's that hosts a seamstress, a barber (who also doubles as the electricity bill collector), a video store, and a convenient store. And within a few minutes walk are various bars, restaurants, and other service providers. As I have discovered, most villages are setup in a similar manner making each one a self contained community.\n\nOne final observation is our village's collection of ~5 stray dogs. Each occupies his own area like the bums you see in Central Sq. - Cambridge, MA -- and every night we hear them howl in unison. One of them, whom Daniel named Ijumaa (Swahili for Friday), follows us home each day as we pass by the village bar after work. Apparently, we are the few people who don't throw rocks at him so he's taken quite kindly to us."
  },
  {
    "title": "Days in Dar",
    "tags": [
      "gcs",
      "tanzania"
    ],
    "date": "5/09/2010",
    "author": "Reuben Cummings",
    "excerpt": "Last week I concluded my trip to Dar es Salaam with Philemon for the CNFA Agrodealers Convention. Wanting to make the most out of my time there, I arrived a few days early so that I could meet with some organizations headquartered there. I arrived late Wednesday evening (4/28) and made arrangements to stay with fellow MIT alum Jamie, CEO of EGG-energy.",
    "content": "Last week I concluded my trip to Dar es Salaam with Philemon for the CNFA Agrodealers Convention. Wanting to make the most out of my time there, I arrived a few days early so that I could meet with some organizations headquartered there. I arrived late Wednesday evening (4/28) and made arrangements to stay with fellow MIT alum Jamie, CEO of [EGG-energy](http://egg-energy.com). Since I was discouraged from taking the dala-dalas at night in Arusha, I was pretty excited to take one to Jamie's place in Msasani. A helpful passenger on the bus made sure I got off at the right stop where Jamie came to pick me up.\n\nI started out the next day meeting Hillary, the Country Director of [TechnoServe/Tanzania](http://www.technoserve.org/work-impact/locations/tanzania.html). I showed her videos of our sheller and charger in action and then took out the samples I brought with me. She was very intrigued by what she saw and gave me a handful of contacts to follow-up with. The next stop was the [Tanzania Investment Centre](http://www.tic.co.tz/) (TIC) where my plan was to meet with the Director. The Director was away on travel but I did manage to get a meeting with John, the Investment Manager. My videos and samples impressed him so much that he ordered one of each on the spot. John also talked a bit about the benefits that TIC certification would provide us at GCS such as assistance getting residents permits, duty incentives, and greater access to investors. I thanked John for his time and then headed over to [FINCA](http://www.finca.org/) for another impromptu meeting.\n\nOne of difficulties of selling products to the rural poor is that many of them can't afford to purchase them. I was hoping that we could work with FINCA to provide financing to our customer base of agrodealers and maize farmers. Unfortunately, the FINCA President was in a meeting and I was told to come back the next day. The next morning I headed back to FINCA and sat with a Credit Manager named Issa. While not as impressed with our company as John from TIC was, he did see some potential and told me to write a proposal. His main concern was that our sheller is a season product and that a bad harvest to impair the farmers' ability to repay their loans.\n\nMy last stop of the day was the CNFA Convention. At lunch, Philemon and I met with Alfred from [KickStart](http://www.kickstart.org). He gave us a lot of valuable advice on how we should market and sell our products. Towards the end of the Convention, I met Kelly from CNFA who introduced me to a bunch of staff from Dar, Arusha, and Mbeya. She also managed to get Philemon and me a spot at the end of the meeting to show our videos which, after overcoming technical difficulties with the usb drive and projector, went over very well. By the end of the day, we landed over a dozen orders each of both the chargers and shellers. A nice way to kick off the sales trip!"
  },
  {
    "title": "Mbeya and Kyela",
    "featured": true,
    "tags": [
      "gcs",
      "travel",
      "tanzania"
    ],
    "date": "5/18/2010",
    "author": "Reuben Cummings",
    "excerpt": "After leaving Dar on the 2nd, I headed south to Mbeya to meet Daniel. The plan was to join up with CNFA for their farmer exhibitions. However, upon arriving to the CNFA office on Monday, we learned that the exhibitions were on hold pending funding. So to make the best of the situation, Daniel and I went to the TechnoServe office the next day (with our newly acquired bike) to follow up with the contact Hillary told me about the week prior.",
    "content": "After leaving Dar on the 2nd, I headed south to Mbeya to meet Daniel. The plan was to join up with CNFA for their farmer exhibitions. However, upon arriving to the CNFA office on Monday, we learned that the exhibitions were on hold pending funding. So to make the best of the situation, Daniel and I went to the TechnoServe office the next day (with our newly acquired bike) to follow up with the contact Hillary told me about the week prior. It turned out that the person I was looking for, Iddi, was based in Kyela (about 1.5 hours further south). I stopped by the Tanganyika Farmers' Association (TFA) next and met the branch manager, Henry, who agreed to let us hold a demonstration in their parking lot at the end of the week. In the few days leading up to the demo, I printed out flyers and rode the bike around town pubbing our demo to every cell phone shop and agrodealer I saw. Friday, the day of demo, turned out to be a bit of a disaster as issues with the bike and sheller delayed the start for several hours. Once we got things working, we demo'd the sheller and charger in front of our modest crowd for another 15 minutes before we had to pack up and head to the next site up the road. In total, we gave 6 demonstrations over three days and were well received by the villagers. Fortunately, the subsequent demos ran much more smoothly than the first.\n\nPleased with our work in Mbeya, we left the sheller and bike at TFA on the 12th as Daniel headed north (with a sheller) to Iringa to visit the remaining TFA's and I headed south (with a charger) to meet Iddi in Kyela. Kyela is remarkably much warmer than Mbeya (I didn't need to wear my sweater at night for example), produces much less maize, almost everyone rides a bike (probably due to the flat landscape and few amount of dala-dalas servicing the town), and lacks power in many of the villages --> a perfect target market for the charger. It just so happened that the TechnoServe office was in the same building as PRIDE and Tujijenge Microfinance (TMF), so Iddi arranged for me to meet with the branch managers of each.\n\nOver the next 2 days (Thurs and Fri) I visited several groups of villagers with TechnoServe and TMF to talk about the phone charger. TechnoServe has a cocoa farmers program and the farmers I met with were very eager to begin selling GCS chargers. Similarly, the TMF farmer loan groups (councils) I presented to were just as impressed. Over the weekend, I tried my luck in town by showing the charger to some store owners. It was a tough sell becuase the charger I had wasn't working and my swahili still isn't all that great. Nevertheless, I tried to explain that they wouldn't have to pay now and landed 6 orders in the end. The feedback I received from the microfinance (mf) groups got me thinking about doing the same thing in Arusha. If we can partner with a few mf organizations, we'll be able to reach a large number of villagers and likely have an easier time landing bulk orders. This plan will have to wait until next week at the earliest however because I will shortly be on my way to Sumbawanga (via Mbeya). CNFA has secured funding so I will soon be hitting the road with them."
  },
  {
    "title": "From South to North",
    "tags": [
      "gcs",
      "tanzania"
    ],
    "date": "6/10/2010",
    "author": "Reuben Cummings",
    "excerpt": "A lot has happened over the past month. I arrived in Sumbawanga on Tuesday, May 18th to join CNFA on a field day demonstration. We spent the first few days making arrangements in preparation for Friday's demonstration. On Friday we arrived to the site, a large field in Malonje Village, and got to work assembling the sheller.",
    "content": "A lot has happened over the past month. I arrived in Sumbawanga on Tuesday, May 18th to join CNFA on a field day demonstration. We spent the first few days making arrangements in preparation for Friday's demonstration. On Friday we arrived to the site, a large field in Malonje Village, and got to work assembling the sheller. Allam, my CNFA contact, had previously informed the villagers that I needed a Phoenix brand bicycle, and they had two waiting for me. I immediately ran into difficulties with the first bike because it had an aftermarket rear rack which was too long for the sheller to fit on. Luckily, Malonje had an abundance of Phoenix bikes and we went through 3 more before finding one that worked. After installing the sheller, we moved it onto a tarp where a group of villagers were eagerly waiting. The demonstration went over fantastically and we shelled half a sack of maize with plenty of audience participation. Once we finished, a group of villagers gave us a wonderful 'thank you' musical celebration full of song and dance. It was a great ending to the day.\n\nWe left Sumbawanga the same day and headed back to Mbeya. On Saturday I went to TFA to install the sheller on the bike we had on display. Henry, TFA Branch Manager, informed me that he had gotten several inquiries about the sheller and charger. This was exciting news and on Monday, we made an agreement for TFA to receive shipments for us from Arusha. This way we could take orders from people in Mbeya and direct them to TFA to pick-up the merchandise. With everything in Mbeya straightened out, I headed north to Dar early Tuesday morning on May 25th. I took advantage of my time in Dar to meet with people from [MUKPAR](http://www.mukpar.com/), [D.light](http://www.dlightdesign.com/), [CNFA](http://www.cnfa.org/), and [Solar-Aid](http://www.solar-aid.org/). These meetings were extremely helpful and introduced me to several new sales and distribution methods. The most promising meeting was with Karan, MUKPAR Director, who really liked the sheller and charger and gave me the contact info for Ganesh, the MUKPAR Arusha Branch Manager. Karan was open to having us put a bicycle in the Arusha Branch to test out customer demand.\n\nI left Dar on Saturday, May 29th for yet another bus ride north, this time back home to Arusha. Following up with my Dar meetings, I met Ganesh the next Thursday on June 3rd and he agreed to let us put a GCS bike and sheller on display. The next day, Jodie and I met with Laura, D.light marketing manager, to discuss ideas for a marketing collaboration. Since my volunteer visa was set to end on June 8th, I made plans to head (north) to Nairobi the following week. A mix-up with with the terms of my visa led me to make a mad dash packing my belongings in time to catch the 2:00 bus to Nairobi on Tuesday the 8th, a day earlier than I had planned to leave. Luckily, I was able to pack and catch the bus with a few minutes to spare. This was just enough time for me to take a few bites of the ugali and cabbage that Jodie brought with her before I boarded the bus. Due to leaving in such a rush, I wasn't able to say goodbye to many of my friends and neighbors. But I will hopefully soon be back to Arusha again."
  }
]
