[
  {
    "title": "Arusha's first Open Data Day",
    "tags": [
      "data",
      "finance",
      "open data",
      "tanzania",
      "python"
    ],
    "date": "3/9/2017",
    "featured": true,
    "author": "Reuben Cummings",
    "content": "This post is adapted (in part) from talks I gave at [Open Data Day Arusha](/podium/odda-sessions-and-workshops-arusha-tanzania/) on March 4, 2017.\n\n### Prologue\n\nAbout a month before [International Open Data Day](//opendataday.org/) was set to commence, I received an [email from HacksHackers Nairobi](https://groups.google.com/forum/#!topic/hackshackers-nairobi/sZ6aJ4ab0es) announcing a round of grants for local Open Data Day events. Having attended Open Data Day Nairobi a couple years back, I was pretty stoked at the thought of bringing a similar experience to Arusha.\n\nWithout wasting time, I put together a Google Form to identify hot topics and early supporters of the initiative. It soon became clear that most people were interested in financial transparency, so I completed the grant application with the theme \"Open Budgets and Spending\", and pressed forward to spread the word about the upcoming event.\n\nUltimately, our grant wasn't approved. But fortunately, the kind folks at Habari Node offered to fund us. And since Mobisol gave us use of their facilities for the event, we were officially \"open for business.\"\n\n### Opening Remarks\n\nWe kicked Open Data Day Arusha (ODDA) off by thanking our sponsors and supporters:\n\n- Arusha Coders\n- Mobisol Tanzania\n- Habari Node\n- JR Institute of Information Technology (JRIIT)\n- Farm Radio's The Hangar\n- AISE - Twende\n\nThen I gave a brief introduction of what Open Data Day was all about.\n\n> Open Data Day is an annual celebration of open data all over the world.\n>\n> — opendataday.org\n\nimage|33282089586\n\nI explained that ODDA was about identifying key issues in Arusha and solving them with open data. Open data itself is information (usually provided by the government) that is\n\n> freely available to everyone to use and republish as they wish, without restrictions from copyright, patents or other mechanisms of control.\n>\n> — wikipedia.org\n\nI also added that data is typically considered \"open\" only if it is available in \"machine readable\" formats such as `csv`, `xls`, or `json`.\n\n### The Issues\n\nIn order to meet the stated goal of \"solving problems in Open Budgets and Spending\", Open Data Day Arusha revolved around discussion, consensus building, and collaboration. The first discussion of the day served to uncover the existing problems.\n\nWith a bit prodding, I surfaced a variety of issues from the participants: mobile money, doing business, accessing student records, etc.\n\nimage|33323016895\n\nEach attendee then voted on their top 3 issues. I used a [Python script](//gist.github.com/reubano/f79023952f71604ca22487342a4bba7a) I prepared the night before to calculate the two most popular. The script applied a [preferential voting system](//en.wikipedia.org/wiki/Ranked_voting_system) technique called [Schulze single transferable vote](//en.wikipedia.org/wiki/Schulze_STV) to an input `csv` file similar to the table below.\n\n A | B | C | D | E | F\n---|---|---|---|---|---\n3|2|||1|\n3||||2|1\n||3||2|1\n|||1|2|3\n||3|1||2\n\nFor this table, each row represents a single ballot. You can interpret the first row as, \"the issues ranked from most to least important are `E, B, A`.\" As you may have noticed in the above picture, the top 2 issues were `E (getting in touch with businesses)` and `F (contacting government officials)`.\n\nThe reason it's so difficult to accomplish these tasks is that email is not a preferred means of communication for many businesses and government agencies. You are best off calling one (of the up to 3) phone lines most business people have. And to contact a government official, you will most likely have to resort to DHL-ing a letter to their office.\n\n### Data Workshop\n\nNow that we were on the same page about the problems to solve, it was time to equip the participants with tools for obtaining and working with data. Our key sponsor, Habari Node, provided cloud storage to which I uploaded relevant data and reports. You can [view the list of downloaded files here](//storage.habari.co.tz/index.php/s/kXKhcwHzk6f4r17). Contact me directly if you would like access to our Open Data Day cloud.\n\nIn addition to pointing out the uploaded files, I also reviewed several other data sources:\n\n- [Tanzania Open Data Portal](//www.opendata.go.tz)\n- [Tanzania Ministry of Finance](//www.mof.go.tz)\n- [Tanzanian Data Lab (dLab)](//dlab.or.tz)\n\nTo give the participants an idea of some of the things they could do with the data, I create some simple visualizations using the `Teachers Service Commission Estimates of the Executive Budget Proposal 2016-2017 Volume II` ([available here](http://www.mof.go.tz/index.php?option=com_content&view=category&layout=blog&id=20&Itemid=560)).\n\nimage|33323027385\nimage|32480411604\n\n### The Solutions\n\nArmed with the issues and a basic understanding of how to handle data, the participants next began a discussion of potential solutions. We discussed existing initiatives such as AsokoInsight and investment promotion in Rwanda.\n\nThe ideas we came up with ranged from a letter tracking service to a government wide customer service ticketing system.\n\nimage|33323023835\n\nFollowing the same voting procedure as before, we identified the top 3 solutions:\n\n- A (an updated business directory)\n- C (something to tell people who to contact based on the task)\n- D (something to help people write official letters to government agencies)\n\nNow the *real* fun began. The participants split into 3 groups (1 per solution) to flesh out their respective ideas and prepare a 10 – 15 minute presentation.\n\nimage|32480398314\nimage|34731564834\n\nTeam A tackled the problem of getting in touch with businesses and presented a web and mobile based business directory application. Their app would be continually updated, provide business locations and contact information, and allow the public to comment on the businesses.\n\nTeam C presented a similar idea to help citizens locate public services such as schools, hospitals, and banks. Their app allowed a user to pick a region and then drill down by category to find the appropriate contact.\n\nThe example user flow they gave was as follows:\n\n```bash\nArusha -> Education -> Universities -> Arusha University -> <Contact Info>\n```\n\nFinally, team D presented a web based letter writing assistant. The user would simply select the purpose of their letter, e.g., visa application or letter of invitation, and the app would choose the appropriate template, recipient, and mailing address. The app would then allow the user to customize the letter prior to printing, stamping, and mailing it on her behalf.\n\nAfter mailing, the app sends email and sms notifications as the letter makes its way to the intended recipient. The app sends its final notification after the recipient responds.\n\nTo encourage businesses and government agencies to participate in the letter notification features, the app would enable officials to process letters more efficiently and accurately than their current methods.\n\nimage|32940470030\nimage|33323020225\n\n### Closing Remarks\n\nTo bring Open Data Day Arusha to a close, I presented the following ways to maintain communication and stay involved in open data:\n\n- [Arusha Coders meetup](//facebook.com/groups/arushacoders)\n- [Open Data Arusha mailing list](//groups.google.com/forum/#!forum/opendata-arusha)\n- [Data Summit](//www.datafest.global/data-summit): March 23 in Scotland\n- [Africa Open Data Conference](//www.africaopendata.net): July 17 - 21 in Accra, Ghana\n- [Data Science Africa](//www.datascienceafrica.org/): July 17 - 21 in Arusha,Tanzania\n- [International Open Data Conference](//opendatacon.org/): Oct 16 in Europe\n\nFinally, Saad from Mobisol talked about how Data Clubs played an important role in his adolescence and encouraged the students in attendance to start a Data Club at their school.\n\nWe ended the day with a discussion on how to improve things for next year. Overall, I think everyone got a lot out of ODDA and are excited to continue their journey into the world of data.\n\n### Epilogue\n\nThis was my first experience organizing an Open Data Day event and I learned quite a bit in the process. In the frantic weeks leading up to (and including) this day, two things were more challenging than I had anticipated.\n\nFirst was the amount of effort required to get public sector organizations and government agencies involved. I contacted individuals from over 35 corporations, organizations, and gov't agencies via email and twitter.\n\nOf those, ~1/3 responded (~1/4 if you remove my personal contacts from the list). And at the end of the day, I wasn't able to get anyone representing the government or public sector (excluding education) to attend.\n\nSecond was attendance estimation. I read that you should expect around half of the people who RSVP to an event to show up. We advertised ODDA as a Facebook event to which around 45 people responded \"yes\" and another 80 responded \"interested\". I also figured the numerous mailing lists we advertised on would draw in a few people who didn't bother to RSVP. So with an expectation of 30 people (`45 * 50% + 80 * 10%`) up to 50 on the high end, imagine my surprise with the actual turnout of 15.\n\n### Comments\n\nDid you attend an Open Data Day event this past weekend? If so, how did it go? What do you think about the issues and solutions presented in this post? Are you involved in or interested in staring a Data Club? Tweet me [@reubano](//twitter.com/reubano) with your thoughts.\n"
  }, {
    "title": "The Journey to Booking Myself Solid - Part I",
    "tags": [
      "freelance",
      "business",
      "mithril",
      "series"
    ],
    "date": "2/9/2017",
    "featured": true,
    "author": "Reuben Cummings",
    "content": "### Where's the cheese?\n\nTwelve months. That's how long it's been since my last client projected ended. *So what have I been doing the past year?* I hear you ask. Aside from watching my savings dwindle, I've put a lot of effort into improving my [open source projects](/projects/), [speaking](//lanyrd.com/profile/reubano/), and [revamping my website](/blog/static-to-dynamic-and-back-again/). Alas, as much as I would love to work non-stop on open source, my [GitHub contribution graph](//github.com/reubano?tab=overview) doesn't pay the bills.\n\nOver the last few months, I've been preparing myself to re-enter the freelance market. Initially, I applied to a few well known curated freelance marketplaces including Toptal and Crew. Crew rejected my application since I didn't have enough \"client specific\" front-end work. Toptal is known for only hiring 3% of all applicants and put me through a rigorous series of code challenges and interviews.\n\nFortunately, I made it to the final Toptal screening. This involved building a single-page web application (SPA) and back-end system with user authentication and roles. I wasn't too happy to spend a week (at least) of my time working on an unpaid \"toy\" project. But I figured Toptal's name recognition would open up some doors and be worth it in the end.\n\nUnfortunately, I didn't quite get everything working in time for the interview and and failed the project review. It's one of those situations where unless you've already completed a similar app in the past, it's difficult to meet their criteria in the given time frame.\n\nTo be fair, I didn't exactly make things easy for myself when I decided to implement the SPA in a JavaScript framework I had never used before ([Mithril.js](//mithril.js.org)). The reasoning behind this was two-fold.\n\nFirst, the only SPA framework I had used up until then was the Backbone based [Chaplin.js](http://chaplinjs.org). Chaplin's last release (v1.1.0) was over a year ago, i.e., an eternity in JS land. And my experience with it taught me that for applications with complex [data-binding](https://github.com/chaplinjs/chaplin/wiki/Cookbook#simple-data-binding) requirements, I should probably [look elsewhere](https://github.com/chaplinjs/chaplin/wiki/Cookbook#limitations).\n\nSecond, I had plans to replace Chaplin.js anyway, so I figured it didn't make sense to invest even more time with it. And if I wasn't going to get paid for my time, I decided to use the opportunity to learn something new. In the process, I found Mithril to be an absolute delight and plan to re-apply to Toptal once I have a few Mithril projects under my belt.\n\n### Tracking the scent\n\nAfter all but giving up on freelance marketplaces, I decided to [educate myself](http://www.kalzumeus.com/2011/10/28/dont-call-yourself-a-programmer/) on [marketing](http://www.theinnovativemanager.com/apple-watch-innovation-that-starts-with-why/) my services. I invested in\n[Book Yourself Solid](https://www.goodreads.com/book/show/126983.Book_Yourself_Solid) by Michael Port, and am currently reading it. Having recently completed the first module on preparing a \"solid foundation\", I'll now show you how I've applied what I learned.\n\n#### My market\n\n> entrepreneurs and product managers of for-profit software companies\n\n#### My cause (why)\n\n> I believe the ability to understand data is key to making informed decisions. Furthermore, I want to lower the barriers to transforming data and extracting meaningful information from it.\n\n#### My persona \n\n##### who am I?\n\n> I am an international speaker and trainer who uses data to show entrepreneurs and product owners how to make better decisions regarding their operations, customers, and products.\n\n##### my tagline\n\n> Your data can talk. Let me tell you what it's saying.\n\n#### My value (how)\n\n> I help organizations eliminate inefficiencies and identify how customers are using their products and services.\n\n#### My service offering (what)\n\n> I collect and interpret business data to uncover a path to increased profitability.\n\nGranted, this isn't nearly as catchy as Michael's, \n\n> I help service professionals get booked solid.\n \nor \n\n> The guy to call when you're tired of thinking small.\n\nBut noticed what I **didn't** say. I didn't call myself a *programmer*, or a *developer*, or even a *data scientist*.\n\nI also didn't say I offer data analysis or web development services. I presented my plan to help companies \"increase revenue or decrease costs\". Now, my offerings very well may include data analysis or web development, but that's an implementation detail.\n\nAccording to Michael, it took him six months to come up with his tagline. So, I shouldn't feel too bad with what I've come up with in the span of a few days.\n\n### Just the beginning\n\nOne aspect I'm still not comfortable with is the, \"Book Yourself Solid Dialogue\". The premise is that I should introduce myself according my \"how\" statement from above. So Michael would say, \n\n> I’m a small business advisor—I help small business owners get more clients.\n\nTranslating my statement, I should say,\n\n> I’m a freelancer consultant—I help organizations eliminate inefficiencies and see how customers are using their products.\n\nor something to that effect.\n\nWhile I'm perfectly comfortable writing that in an email, on my [website](/about/), or in my [LinkedIn profile](//www.linkedin.com/in/reubano), I can't bring myself to actual *say* it to someone who asks me, \"What do you do?\" I'm much more inclined to revert to the bland, \"I'm a data scientist\" or \"I'm a freelance software developer.\" \n\nDoes that mean I haven't truly nailed down my positioning statements? Maybe. Or I could just need more time to get comfortable talking about myself. \n\n`¯\\_(ツ)_/¯`\n\nI'm already looking forward to the book's next module on developing a \"strategy for creating trust and credibility\". Stay tuned for part II.\n\nWhat's your take? Do the above statements give you a clear indication of my value proposition? Does it match what you know about me? Tweet me [@reubano](//twitter.com/reubano) with your thoughts.\n"
  },
  {
    "title": "Static to Dynamic and Back Again",
    "tags": [
      "static site",
      "coffeescript",
      "python",
      "javascript",
      "riko",
      "ruby"
    ],
    "date": "12/14/2016",
    "featured": true,
    "author": "Reuben Cummings",
    "content": "### The many faces of reubano\n\nFor those of you keeping track, I've now redesigned [my website](//reubano.xyz) for the second time since its inception. I created my first website with the static site generator (SSG) Octopress. This first site contained a blog, project portfolio, archives, and several pages (home, about, and contact). \n\nimage|30858818694\n\nDespite Octopress' popularity and breadth of plugins, the Pythonista in me couldn't stand its Ruby centric tooling. For the first rewrite, I decide to try a new approach with a [Backbone.js](//backbonejs.org/) based single page app (SPA). \n\nimage|31327956640\n\nTo reduce the required boilerplate and provide my SPA a bit of structure, I used [Chaplin.js](//chaplinjs.org/) in combination with the asset compiler [Brunch](//brunch.io/). Using Brunch and two [custom](//github.com/reubano/markdown-brunch) [plugins](//github.com/reubano/ls-brunch), I was able to emulate Octopress' markdown workflow. In addition, I gained the ability create pages from JSON data sources. I eagerly used this new power to generate a project portfolio from the GitHub API. Keeping with the JSON theme, I also generated a photo gallery from the Flickr API.\n\nClient side JavaScript really shone here. I was able to use cached JSON files in development, but fetch data directly from the APIs in the live version of the site. This meant that any repos I created on GitHub or photos I uploaded to Flickr would instantly appear on the site without additional intervention. I also loved that you could navigate the entire site without page refreshes or server calls after initialization. This meant the site worked offline once it was loaded.\n\nSadly, all good things must come to an end. Chaplin's maintainers effectively ceased development on the framework. This, in combination with overall [JS fatigue](//hackernoon.com/how-it-feels-to-learn-javascript-in-2016-d3a717dd577f), motivated me to reconsider static sites.\n\n### SSG selection\n\nSince I had recently given a [talk on SSGs](//speakerdeck.com/reubano/static-sites-and-generators-ftw), I had a decent idea of what I was looking for. I was also determined to make the new site as [lightweight as possible](//vimeo.com/147806338). This meant I was going to abandon Bootstrap, jquery, Google Analytics, and web fonts.\n\n#### The contenders\n\nI'll save the gory details on the pros and cons of each SSG that I tried for a later post. But after trying out Roots, Hexo, Wintersmith, and Hugo, I decided to go with [Metalsmith](//metalsmith.io). Metalsmith was the only SSG that gave me flexibility, a comprehensive feature set, and ability to write plugins in a decent language (CoffeeScript in this case). \n\nimage|31554022252\n\nI briefly considered a few Python SSGs such as [Nikola](//www.getnikola.com/) and [MkDocs](//www.mkdocs.org/), but found their integration with my frontend stack (stylus and pug, aka jade) to be lacking at best. \n\nThis isn't to say Metalsmith is a panacea, [not in the least](//evocode.com/blog/mastering-metalsmith-best-practices-for-static-sites/#metalsmith-drawbacks). What irks me the most is that Metalsmith is very [picky about the order](//github.com/metalsmith/metalsmith/issues/195) you load plugins in, and suffers from [slow compile times](#slow-compilation). Hexo did a great job of alleviating the first issue (and possibly the second) with their plugin [registration system](//hexo.io/api/processor.html).\n\n#### Slow compilation\n\nInternally, Metalsmith passes the complete list of files to each plugin, and almost every plugin needs to iterate through the entire list in order to do anything meaningful. The following is an example plugin that removes all `draft` posts from the pipeline.\n\n<small>plugin.coffee</small>\n```coffeescript\nmodule.exports = (options) ->\n  (files, metalsmith, done) ->\n    setImmediate(done)\n    \n    for file, data of files\n      if (data.draft) \n        delete files[file]\n```\n\nThe overhead of this architecture becomes present as you scale the number of pages built. Using [`dumbbench`](//search.cpan.org/~smueller/Dumbbench-0.10/lib/Dumbbench.pm) I retrieved the following timings in **development mode**:\n\n| Files | Iterations | Ave Build Time (s) | Uncertainty (s) |\n|------:|-----------:|-------------------:|----------------:|\n|   128 |         21 |              11.62 |            0.10 |\n|   174 |         20 |              12.68 |            0.22 |\n|   292 |         20 |              13.12 |            0.21 |\n|   376 |         20 |              14.29 |            0.36 |\n\nAnd the following timings are the result from **production mode** which performs file minification and compression steps:\n\n| Files | Iterations | Ave Build Time (s) | Uncertainty (s) |\n|------:|-----------:|-------------------:|----------------:|\n|   233 |         20 |              14.84 |            0.13 |\n|   325 |         23 |              17.14 |            0.15 |\n|   561 |         20 |              20.65 |            0.57 |\n|   729 |         20 |              23.56 |            0.52 |\n\nAs you can see in the following graph, the development run displays a [time complexity](//rob-bell.net/2009/06/a-beginners-guide-to-big-o-notation/) on the order of `log(N)`, while the production run crosses over into linear territory on the order of `N`. Yet, even with logarithmic growth in the best case, Metalsmith still takes an eternity (almost 15 secs) to rebuild my site. And as I point out [below](#the-ugly), I have to wait for a full rebuild after each change.\n\nimage|31700406205\n\n#### The ugly\n\nAdditionally, JavaScript's inherent mutability is a [major source of pain](//github.com/segmentio/metalsmith-collections/issues/27). And despite my best efforts, I was never able to get either the [metalsmith-watch](//github.com/FWeinb/metalsmith-watch) or [metalsmith-changed](//github.com/arve0/metalsmith-changed) plugins to work.\n\n### Future work\n\nThe ideal SSG would iterate through the list of files a fixed number of times and then pass each file to every plugin in parallel. This would be most effective with immutable data structures like Python's [`MappingProxyType`](//docs.python.org/3/library/types.html#types.MappingProxyType) or Clojure's [`Maps`](//clojure.org/reference/data_structures#Maps).\n\nI eventually want to look under the hood of [Nikola](//www.getnikola.com/) since it [may relieve](//chriswarrick.com/blog/2015/07/23/ssg-speed-test/) some of issues stated above. Plus with the help of [python-stylus](//github.com/bkad/python-stylus) and [pyjade](//github.com/SyrusAkbary/pyjade), I may even be able to reuse my templates.\n\nUltimately, I don't think I will ever be completely satisfied without building my own SSG. Something that combines the speed of Hugo, the elegance of Hexo, and the flexibilty of Metalsmith. My stream processing library [riko](//github.com/nerevu/riko) would provide a good foundation on which to build such a framework. If only I had the time...\n\nDo you have any SSG experiences to share? Tweet your story to me [@reubano](https://twitter.com/reubano).\n"
  },
  {
    "title": "Embu Demonstration",
    "tags": [
      "travel",
      "ethiopia",
      "kenya",
      "gcs"
    ],
    "date": "3/12/2010",
    "author": "Reuben Cummings",
    "content": "Upon returning from Ethiopia, I met up with Jodie and Daniel in Nairobi, Kenya to head to Embu (a city northwest of Nairobi) for a project demonstration. In Embu, we met with Mama Peter, the chairwoman of the Kenera Women's Water Project, and some members of the town youth group. We came because we heard the community had maize ready for shelling and since dry maize is pretty scarce this time in Arusha, we were eager to get feedback on our sheller. After talking with the group about the Water Project and our maize sheller, we went to Mama Peter's farm where a pile of maize drying in the sun awaited us. We assembled the machine with a few of the group members and began shelling the corn. Unfortunately, the maize wasn't quite dry enough and we had a difficult time trying to shell it. Next, we demonstrated the cell phone charger but the group informed us that most of the villagers have access to electricity so the demand for a bicycle powered charger wouldn't be as high.\n\nAfterward, we showed the group how they could use the leftover corn husks and cobs to make charcoal in a metal drum. The process is relatively simple: you layer the cobs and husks inside the drum, light it on fire from the top and bottom, burn off the water, cover it, mix it with cassava, and press it to briquettes. The group was very impressed with the charcoal (more so than they were with the maize sheller) and interested in exploring the business opportunities our devices presented. We left a maize sheller with the group and they told us they would do more testing once the maize dried for a few more days."
  },
  {
    "title": "Kikatiti Demo",
    "tags": [
      "gcs",
      "tanzania"
    ],
    "date": "3/25/2010",
    "author": "Reuben Cummings",
    "content": "Today I experienced my second GCS demo. This one was at a [CNFA](http://www.cnfa.org/) agrodealer exhibition in Kikatiti, Tanzania. The exhibition site was located in an open field near an elementary school pretty high in the hills. Once we set up the tent, Philemon and I prepared our booth and waited for the villagers to come. A small crowd soon formed around us as we began shelling the maize we brought with us. After shelling a few cobs, I got off the bike and passed out brochures. With my limited knowledge of Kiswahili, I said \"Nasema Kiswahili kidogo tu\" (\"I only speak a little Swahili\") to anyone who spoke to me and pointed at the brochure if I heard \"shingapi?\" (\"how much?\"). We also demonstrated the cell phone charger which went over very well with the crowd. Ultimately, our customers will be the other agrodealers present at the exhibition so we will have to figure out the best way to get them as interested in our devices as the villagers were."
  },
  {
    "title": "Thoughts on Arusha",
    "tags": [
      "tanzania"
    ],
    "date": "4/09/2010",
    "author": "Reuben Cummings",
    "content": "So far, I've been in Arusha for a month and have found my time here to be quite enjoyable. My first observations were how much brighter the stars look in the sky and how small the community is. The size of the community became apparent after going out my second night and recognizing many of the patrons from my previous night out. Since the selection of night clubs is rather limited, it appears that each one has a core following of people who show up religiously each week. Unfortunately, the following tends to consist of an order of magnitude more men than women. But fortunately, the DJ's have been consistently good and play a mix of reggae, tanzanian/african tunes, hip-hop, and house.\n\nMy neighborhood, although just a few minute drive to town, has a very rural feel to it. It's fairly common to share the dirt roads with a herd of cattle or goats looking for pasture, or a mother hen and her chicks pecking for food. I've become quite accustomed to waking up to the crow of our neighbor's rooster and the occasional flock of chickens that raid our front yard looking for food scraps. However, despite the ruralness of our village, most everything you could possibly need is readily available. Around the corner from our house is a \"strip mall\" of duka's that hosts a seamstress, a barber (who also doubles as the electricity bill collector), a video store, and a convenient store. And within a few minutes walk are various bars, restaurants, and other service providers. As I have discovered, most villages are setup in a similar manner making each one a self contained community.\n\nOne final observation is our village's collection of ~5 stray dogs. Each occupies his own area like the bums you see in Central Sq. - Cambridge, MA -- and every night we hear them howl in unison. One of them, whom Daniel named Ijumaa (Swahili for Friday), follows us home each day as we pass by the village bar after work. Apparently, we are the few people who don't throw rocks at him so he's taken quite kindly to us."
  },
  {
    "title": "Days in Dar",
    "tags": [
      "gcs",
      "tanzania"
    ],
    "date": "5/09/2010",
    "author": "Reuben Cummings",
    "content": "Last week I concluded my trip to Dar es Salaam with Philemon for the CNFA Agrodealers Convention. Wanting to make the most out of my time there, I arrived a few days early so that I could meet with some organizations headquartered there. I arrived late Wednesday evening (4/28) and made arrangements to stay with fellow MIT alum Jamie, CEO of [EGG-energy](http://egg-energy.com). Since I was discouraged from taking the dala-dalas at night in Arusha, I was pretty excited to take one to Jamie's place in Msasani. A helpful passenger on the bus made sure I got off at the right stop where Jamie came to pick me up.\n\nI started out the next day meeting Hillary, the Country Director of [TechnoServe/Tanzania](http://www.technoserve.org/work-impact/locations/tanzania.html). I showed her videos of our sheller and charger in action and then took out the samples I brought with me. She was very intrigued by what she saw and gave me a handful of contacts to follow-up with. The next stop was the [Tanzania Investment Centre](http://www.tic.co.tz/) (TIC) where my plan was to meet with the Director. The Director was away on travel but I did manage to get a meeting with John, the Investment Manager. My videos and samples impressed him so much that he ordered one of each on the spot. John also talked a bit about the benefits that TIC certification would provide us at GCS such as assistance getting residents permits, duty incentives, and greater access to investors. I thanked John for his time and then headed over to [FINCA](http://www.finca.org/) for another impromptu meeting.\n\nOne of difficulties of selling products to the rural poor is that many of them can't afford to purchase them. I was hoping that we could work with FINCA to provide financing to our customer base of agrodealers and maize farmers. Unfortunately, the FINCA President was in a meeting and I was told to come back the next day. The next morning I headed back to FINCA and sat with a Credit Manager named Issa. While not as impressed with our company as John from TIC was, he did see some potential and told me to write a proposal. His main concern was that our sheller is a season product and that a bad harvest to impair the farmers' ability to repay their loans.\n\nMy last stop of the day was the CNFA Convention. At lunch, Philemon and I met with Alfred from [KickStart](http://www.kickstart.org). He gave us a lot of valuable advice on how we should market and sell our products. Towards the end of the Convention, I met Kelly from CNFA who introduced me to a bunch of staff from Dar, Arusha, and Mbeya. She also managed to get Philemon and me a spot at the end of the meeting to show our videos which, after overcoming technical difficulties with the usb drive and projector, went over very well. By the end of the day, we landed over a dozen orders each of both the chargers and shellers. A nice way to kick off the sales trip!"
  },
  {
    "title": "Mbeya and Kyela",
    "tags": [
      "gcs",
      "travel",
      "tanzania"
    ],
    "date": "5/18/2010",
    "author": "Reuben Cummings",
    "content": "After leaving Dar on the 2nd, I headed south to Mbeya to meet Daniel. The plan was to join up with CNFA for their farmer exhibitions. However, upon arriving to the CNFA office on Monday, we learned that the exhibitions were on hold pending funding. So to make the best of the situation, Daniel and I went to the TechnoServe office the next day (with our newly acquired bike) to follow up with the contact Hillary told me about the week prior. It turned out that the person I was looking for, Iddi, was based in Kyela (about 1.5 hours further south). I stopped by the Tanganyika Farmers' Association (TFA) next and met the branch manager, Henry, who agreed to let us hold a demonstration in their parking lot at the end of the week. In the few days leading up to the demo, I printed out flyers and rode the bike around town pubbing our demo to every cell phone shop and agrodealer I saw. Friday, the day of demo, turned out to be a bit of a disaster as issues with the bike and sheller delayed the start for several hours. Once we got things working, we demoed the sheller and charger in front of our modest crowd for another 15 minutes before we had to pack up and head to the next site up the road. In total, we gave 6 demonstrations over three days and were well received by the villagers. Fortunately, the subsequent demos ran much more smoothly than the first.\n\nPleased with our work in Mbeya, we left the sheller and bike at TFA on the 12th as Daniel headed north (with a sheller) to Iringa to visit the remaining TFA's and I headed south (with a charger) to meet Iddi in Kyela. Kyela is remarkably much warmer than Mbeya (I didn't need to wear my sweater at night for example), produces much less maize, almost everyone rides a bike (probably due to the flat landscape and few amount of dala-dalas servicing the town), and lacks power in many of the villages --> a perfect target market for the charger. It just so happened that the TechnoServe office was in the same building as PRIDE and Tujijenge Microfinance (TMF), so Iddi arranged for me to meet with the branch managers of each.\n\nOver the next 2 days (Thurs and Fri) I visited several groups of villagers with TechnoServe and TMF to talk about the phone charger. TechnoServe has a cocoa farmers program and the farmers I met with were very eager to begin selling GCS chargers. Similarly, the TMF farmer loan groups (councils) I presented to were just as impressed. Over the weekend, I tried my luck in town by showing the charger to some store owners. It was a tough sell because the charger I had wasn't working and my swahili still isn't all that great. Nevertheless, I tried to explain that they wouldn't have to pay now and landed 6 orders in the end. The feedback I received from the microfinance (mf) groups got me thinking about doing the same thing in Arusha. If we can partner with a few mf organizations, we'll be able to reach a large number of villagers and likely have an easier time landing bulk orders. This plan will have to wait until next week at the earliest however because I will shortly be on my way to Sumbawanga (via Mbeya). CNFA has secured funding so I will soon be hitting the road with them."
  },
  {
    "title": "From South to North",
    "tags": [
      "gcs",
      "tanzania"
    ],
    "date": "6/10/2010",
    "author": "Reuben Cummings",
    "content": "A lot has happened over the past month. I arrived in Sumbawanga on Tuesday, May 18th to join CNFA on a field day demonstration. We spent the first few days making arrangements in preparation for Friday's demonstration. On Friday we arrived to the site, a large field in Malonje Village, and got to work assembling the sheller. Allam, my CNFA contact, had previously informed the villagers that I needed a Phoenix brand bicycle, and they had two waiting for me. I immediately ran into difficulties with the first bike because it had an after-market rear rack which was too long for the sheller to fit on. Luckily, Malonje had an abundance of Phoenix bikes and we went through 3 more before finding one that worked. After installing the sheller, we moved it onto a tarp where a group of villagers were eagerly waiting. The demonstration went over fantastically and we shelled half a sack of maize with plenty of audience participation. Once we finished, a group of villagers gave us a wonderful 'thank you' musical celebration full of song and dance. It was a great ending to the day.\n\nWe left Sumbawanga the same day and headed back to Mbeya. On Saturday I went to TFA to install the sheller on the bike we had on display. Henry, TFA Branch Manager, informed me that he had gotten several inquiries about the sheller and charger. This was exciting news and on Monday, we made an agreement for TFA to receive shipments for us from Arusha. This way we could take orders from people in Mbeya and direct them to TFA to pick-up the merchandise. With everything in Mbeya straightened out, I headed north to Dar early Tuesday morning on May 25th. I took advantage of my time in Dar to meet with people from [MUKPAR](http://www.mukpar.com/), [D.light](http://www.dlightdesign.com/), [CNFA](http://www.cnfa.org/), and [Solar-Aid](http://www.solar-aid.org/). These meetings were extremely helpful and introduced me to several new sales and distribution methods. The most promising meeting was with Karan, MUKPAR Director, who really liked the sheller and charger and gave me the contact info for Ganesh, the MUKPAR Arusha Branch Manager. Karan was open to having us put a bicycle in the Arusha Branch to test out customer demand.\n\nI left Dar on Saturday, May 29th for yet another bus ride north, this time back home to Arusha. Following up with my Dar meetings, I met Ganesh the next Thursday on June 3rd and he agreed to let us put a GCS bike and sheller on display. The next day, Jodie and I met with Laura, D.light marketing manager, to discuss ideas for a marketing collaboration. Since my volunteer visa was set to end on June 8th, I made plans to head (north) to Nairobi the following week. A mix-up with with the terms of my visa led me to make a mad dash packing my belongings in time to catch the 2:00 bus to Nairobi on Tuesday the 8th, a day earlier than I had planned to leave. Luckily, I was able to pack and catch the bus with a few minutes to spare. This was just enough time for me to take a few bites of the ugali and cabbage that Jodie brought with her before I boarded the bus. Due to leaving in such a rush, I wasn't able to say goodbye to many of my friends and neighbors. But I will hopefully soon be back to Arusha again."
  }
]
